Repository: sportorg/pysport
Catalog: languages/*/LC_MESSAGES/sportorg.po
Languages: ru_ru

source: About
ru_ru: О нас

source: Contributors
ru_ru: Разработчики

source: Home page
ru_ru: Веб-сайт

source: Bib
ru_ru: Номер

source: OK
ru_ru: ОК

source: Cancel
ru_ru: Отмена

source: Group
ru_ru: Группа

source: Card
ru_ru: Номер чипа

source: not found
ru_ru: не найдено

source: Template
ru_ru: Шаблон

source: Choose template
ru_ru: Выберете шаблон

source: Open HTML template
ru_ru: Открыть HTML шаблон

source: HTML file (*.html)
ru_ru: Файл HTML (*.html)

source: Sorting by
ru_ru: Сортировка по

source: Team
ru_ru: Команда

source: Save As HTML file
ru_ru: Сохранить как HTML

source: Course properties
ru_ru: Свойства дистанции

source: Name
ru_ru: Название

source: Length
ru_ru: Длина

source: Climb
ru_ru: Набор высоты

source: Point count
ru_ru: Количество КП

source: Controls
ru_ru: Контрольные пункты

source: Delete CP
ru_ru: Удалить КП

source: Number CP
ru_ru: Номер КП

source: Courses
ru_ru: Дистанции

source: Race Results
ru_ru: Результаты

source: Ok
ru_ru: Оk

source: Results
ru_ru: Результаты

source: Entry properties
ru_ru: Редактирование спортсмена

source: Last name
ru_ru: Фамилия

source: First name
ru_ru: Имя

source: Birthday
ru_ru: Дата рождения

source: Year of birth
ru_ru: Год рождения

source: Qualification
ru_ru: Квалификация

source: Start time
ru_ru: Время старта

source: Start group
ru_ru: Забег

source: Punch card #
ru_ru: Номер чипа

source: rented card
ru_ru: аренда чипа

source: is paid
ru_ru: оплачено

source: out of competition
ru_ru: в/к

source: personal participation
ru_ru: лично

source: Comment
ru_ru: Комментарий

source: Number already exists
ru_ru: Номер уже существует

source: Number is unique
ru_ru: Номер уникален

source: Card number already exists
ru_ru: Номер чипа уже существует

source: Card number is unique
ru_ru: Номер чипа уникален

source: Filter Dialog
ru_ru: Фильтрация

source: Event properties
ru_ru: Свойства соревнования

source: Main title
ru_ru: Название соревнований

source: Sub title
ru_ru: Заголовок

source: Start date
ru_ru: Дата начала

source: End date
ru_ru: Дата завершения

source: Location
ru_ru: Место проведения

source: Event type
ru_ru: Тип соревнований

source: Relay legs
ru_ru: Количество этапов

source: Chief referee
ru_ru: Главный судья

source: Secretary
ru_ru: Главный секретарь

source: Group properties
ru_ru: Свойства группы

source: Full name
ru_ru: Полное наименование

source: Course
ru_ru: Дистанция

source: Sex
ru_ru: Пол

source: Min age
ru_ru: Минимальный возраст

source: Max age
ru_ru: Максимальный возраст

source: Max time
ru_ru: Контрольное время

source: Start corridor
ru_ru: Стартовый коридор

source: Order in corridor
ru_ru: Порядок в коридоре

source: Start interval
ru_ru: Стартовый интервал

source: Start fee
ru_ru: Стартовый взнос

source: Type
ru_ru: Тип

source: Rank calculation
ru_ru: Выполнение разрядов

source: Configuration
ru_ru: Настройка

source: Rank
ru_ru: Ранг (ориентирование)

source: Max place
ru_ru: Макс. место

source: Result time
ru_ru: Результат

source: Live
ru_ru: Онлайн

source: Token
ru_ru: Токен

source: Enabled
ru_ru: Включить

source: URL not valid
ru_ru: URL недействителен

source: Not started numbers
ru_ru: Не стартовавшие участники

source: Dialog
ru_ru: Диалог

source: Source number
ru_ru: Исходный номер

source: Target number
ru_ru: Присваиваемый номер

source: Remove source
ru_ru: Удалять исходный номер

source: Replace source with reserve
ru_ru: Создать резервного участника для исходного номера

source: Team properties
ru_ru: Свойства коллектива

source: Country
ru_ru: Страна

source: Region
ru_ru: Субъект РФ

source: City
ru_ru: Город

source: Address
ru_ru: Адрес

source: Contact
ru_ru: Контактные данные

source: Printer settings
ru_ru: Настройки печати

source: Default printer
ru_ru: Основной принтер

source: select
ru_ru: выбрать

source: Default split printer
ru_ru: Принтер для сплитов

source: Print splits
ru_ru: Печать сплитов

source: Relay number
ru_ru: Эстафетные номера

source: First relay number
ru_ru: Первый эстафетный номер

source: Report creating
ru_ru: Создание протокола

source: Open in browser
ru_ru: Открыть в браузере

source: Save to last file
ru_ru: Сохранить в последний файл

source: Result
ru_ru: Результат

source: DNS
ru_ru: НЕ СТАРТ.

source: DNF
ru_ru: СОШЕЛ

source: Overtime
ru_ru: ПРЕВЫШЕНО КВ

source: DSQ
ru_ru: ДИСКВ.

source: Days
ru_ru: Дней

source: Start
ru_ru: Старт

source: Finish
ru_ru: Финиш

source: Penalty
ru_ru: Штраф

source: Penalty legs
ru_ru: Штраф, круги

source: Splits
ru_ru: Сплиты

source: Search
ru_ru: Поиск

source: The search has not given any results
ru_ru: Поиск не дал результатов

source: Languages
ru_ru: Язык интерфейса

source: Show toolbar
ru_ru: Показать панель инструментов

source: Auto save
ru_ru: Автосохранение

source: Auto connect to SPORTident station
ru_ru: Автоматическое подключение станции SPORTident

source: Open recent file
ru_ru: Открыть последний файл

source: Use birthday
ru_ru: Использовать день рождения, а не только год

source: Successful result
ru_ru: Успешный результат

source: Unsuccessful result
ru_ru: Неуспешный результат

source: Main settings
ru_ru: Основные настройки

source: Sounds
ru_ru: Звуки

source: Settings
ru_ru: Настройки

source: Start times
ru_ru: Шахматка

source: Start Preparation
ru_ru: Подготовка к старту

source: Reserves insert
ru_ru: Вставка резервных участников

source: Reserve prefix
ru_ru: Имя для резервных участников

source: Reserve
ru_ru: _Резерв

source: Reserves per group, ps
ru_ru: Количество резервов на группу, шт.

source: Reserves per group, %
ru_ru: Количество резервов на группу, %

source: Insert reserves
ru_ru: Добавлять резервы

source: Draw
ru_ru: Жеребьевка

source: Split by start groups
ru_ru: С учетом забегов

source: Split by teams
ru_ru: С учетом коллективов

source: Split by regions
ru_ru: С учетом субъектов РФ

source: Mix groups
ru_ru: Общая жеребьевка по дистанции

source: Change start time
ru_ru: Присвоение стартового времени

source: First start in corridor
ru_ru: Первый старт

source: Fixed start interval
ru_ru: Заданный интервал

source: Take start interval from group settings
ru_ru: Брать стартовый интервал из настроек групп

source: Start numbers
ru_ru: Стартовые номера

source: Change start numbers
ru_ru: Присваивать номера

source: First number
ru_ru: Первый номер

source: interval
ru_ru: интервал

source: Number = corridor + minute
ru_ru: Номер = коридор + минута

source: Start list
ru_ru: Протокол старта

source: Save to file
ru_ru: Сохранить в файл

source: Start time change
ru_ru: Смещение времени старта

source: Add
ru_ru: Добавлять

source: Reduce
ru_ru: Отнять

source: Entries statistics
ru_ru: Протокол комиссии по допуску

source: Team list
ru_ru: Выписка по командам

source: Teamwork
ru_ru: Командная работа

source: Type connection
ru_ru: Тип соединения

source: Client
ru_ru: Клиент

source: Server
ru_ru: Сервер

source: Host
ru_ru: Хост

source: Port
ru_ru: Порт

source: Client/Server
ru_ru: Клиент/Сервер

source: Penalty time
ru_ru: Штраф, время

source: Card number
ru_ru: Номер чипа

source: Values
ru_ru: Значения

source: Identifier
ru_ru: Идентификатор

source: Person name
ru_ru: Имя спортсмена

source: Value
ru_ru: Значение

source: Separator
ru_ru: Разделитель

source: space
ru_ru: пробел

source: tab
ru_ru: табуляция

source: semicolon
ru_ru: точка с запятой

source: custom
ru_ru: пользовательский

source: Timekeeping settings
ru_ru: Настройки хронометража

source: Zero time
ru_ru: Начало соревнований

source: Available Ports
ru_ru: Доступные порты

source: From protocol
ru_ru: Из протокола

source: Start station
ru_ru: Стартовая станция

source: Control point
ru_ru: Контрольный пункт

source: Start gate
ru_ru: Стартовая калитка

source: Finish time
ru_ru: Финишное время

source: Finish station
ru_ru: Финишная станция

source: Light beam
ru_ru: Луч

source: Assigning a chip when reading
ru_ru: Присвоение чипов при чтении

source: Off
ru_ru: Отключено

source: Only unknown members
ru_ru: Только неизвестные чипы

source: Always
ru_ru: Всегда

source: Assignment mode
ru_ru: Режим присвоения

source: by time
ru_ru: по времени

source: by scores
ru_ru: по баллам

source: rogain scores
ru_ru: рогейн (45КП = 4балла, 78КП = 7баллов)

source: fixed scores
ru_ru: фиксированные баллы за КП

source: minute penalty
ru_ru: Штраф за каждую просроченную минуту

source: no penalty
ru_ru: штрафа не начисляется

source: penalty time
ru_ru: штрафное время

source: penalty laps
ru_ru: штрафные круги

source: counting lap
ru_ru: оценочный круг

source: lap station
ru_ru: станция на штрафном круге

source: scores off
ru_ru: очки не рассчитываются

source: scores array
ru_ru: список значений

source: scores formula
ru_ru: расчет очков по формуле

source: scores formula hint
ru_ru: Составьте произвольную формулу. Поддерживаются переменные: leader - результат победителя группы; time - результат участника

source: Persons in team
ru_ru: Количество человек для командного зачета

source: Grouping
ru_ru: Группировка

source: organization grouping
ru_ru: группировка по коллективам

source: region grouping
ru_ru: группировка по субъектам РФ

source: Sum
ru_ru: Сумма

source: scores
ru_ru: очки

source: time
ru_ru: время

source: places
ru_ru: места

source: Accuracy
ru_ru: Учитывать доли сек. знаков

source: Format of competitions
ru_ru: Формат соревнований

source: SPORTident (Sportiduino) settings
ru_ru: Настройки SPORTident (Sportiduino)

source: Result processing
ru_ru: Определение результата

source: Team results
ru_ru: Командные результаты

source: Scores
ru_ru: Очки

source: Penalty calculation
ru_ru: Расчет штрафа из сплитов

source: Time settings
ru_ru: Настройки времени

source: Are you sure you want to exit the program?
ru_ru: Вы действительно хотите закрыть приложение?

source: Question
ru_ru: Вопрос

source: Toolbar
ru_ru: Панель инструментов

source: Groups
ru_ru: Группы

source: Teams
ru_ru: Коллективы

source: Logs
ru_ru: Логи

source: Tab doesn't exist
ru_ru: Раздел не существует

source: No file to auto save
ru_ru: Имя файла не задано, автосохранение отменено

source: Create SportOrg file
ru_ru: Создать файл SportOrg

source: SportOrg file (*.json)
ru_ru: Файл SportOrg (*.json)

source: Error
ru_ru: Ошибка

source: Cannot create file
ru_ru: Файл не создан

source: Cannot read file, format unknown
ru_ru: Не удается открыть файл, некорректный формат

source: No result selected
ru_ru: Результат не выбран

source: No results to print
ru_ru: Нет результатов для печати

source: No printer selected
ru_ru: Принтер не выбран

source: Please confirm
ru_ru: Пожалуйста, подтвердите действие

source: Cannot remove group
ru_ru: Невозможно удалить группу

source: Cannot remove course
ru_ru: Невозможно удалить дистанцию

source: Cannot remove organization
ru_ru: Невозможно удалить коллектив

source: Open SportOrg file
ru_ru: Открыть файл SportOrg

source: Open CSV Winorient file
ru_ru: Открыть файл CSV Winorient

source: CSV Winorient (*.csv)
ru_ru: Файл CSV Winorient (*.csv)

source: Import error
ru_ru: Ошибка импорта

source: Open WDB Winorient file
ru_ru: Открыть файл WDB Winorient

source: WDB Winorient (*.wdb)
ru_ru: Файл WDB Winorient (*.wdb)

source: Open Ocad txt v8 file
ru_ru: Открыть файл дистанций OCAD8

source: Ocad classes v8 (*.txt)
ru_ru: Файл дистанций OCAD8 (*.txt)

source: Save As WDB file
ru_ru: Сохранить в файл Winorient (WDB)

source: WDB file (*.wdb)
ru_ru: Файл Winorient (*.wdb)

source: Export error
ru_ru: Ошибка экспорта

source: Save As IOF xml
ru_ru: Сохранение IOF xml

source: IOF xml (*.xml)
ru_ru: Файл IOF xml (*.xml)

source: Use bib as card number
ru_ru: Заменить номера чипов нагрудными номерами

source: No results to change status
ru_ru: Нет результата для изменения статуса

source: File
ru_ru: Файл

source: New
ru_ru: Новый

source: Save
ru_ru: Сохранить

source: Open
ru_ru: Открыть

source: Save As
ru_ru: Сохранить как

source: Event Settings
ru_ru: Свойства соревнования

source: Import
ru_ru: Импорт

source: CSV Winorient
ru_ru: Файл CSV Winorient

source: WDB Winorient
ru_ru: Файл WDB Winorient

source: Ocad txt v8
ru_ru: Дистанции версии OCAD8 (Текст)

source: Export
ru_ru: Экспорт

source: Edit
ru_ru: Редактировать

source: Add object
ru_ru: Добавить запись

source: Delete
ru_ru: Удалить

source: Text exchange
ru_ru: Текстовый импорт/экспорт

source: View
ru_ru: Вид

source: Refresh
ru_ru: Обновить

source: Filter
ru_ru: Фильтрация

source: Guess courses
ru_ru: Подбор дистанций для групп

source: Guess corridors
ru_ru: Подбор коридоров для групп

source: Relay number assign mode
ru_ru: Режим присвоения номеров для эстафет

source: Print Bib
ru_ru: Печать номеров

source: Race
ru_ru: Соревнование

source: Manual finish
ru_ru: Ручной финиш

source: Add SPORTident result
ru_ru: Добавить SPORTident результат

source: Create report
ru_ru: Создать протокол

source: Create team results report
ru_ru: Создать командный протокол

source: Split printout
ru_ru: Печать сплитов

source: Rechecking
ru_ru: Перепроверить отметку

source: Penalty removing
ru_ru: Обнуление штрафа

source: Change status
ru_ru: Изменить статус

source: Set DNS numbers
ru_ru: Ввести номера со статусом DNS

source: Service
ru_ru: Сервис

source: on/off SPORTident readout
ru_ru: Запустить/остановить чтение чипов SPORTident

source: on/off Sportiduino readout
ru_ru: Запустить/остановить чтение чипов Sportiduino

source: on/off SFR readout
ru_ru: Запустить/остановить чтение чипов SFR

source: Send selected
ru_ru: Отправить выбранные

source: On/Off
ru_ru: Включить/Выключить

source: Send start list
ru_ru: Отправить стартовый протокол

source: Send results
ru_ru: Отправить результаты

source: Resend results
ru_ru: Переотправить результаты

source: Options
ru_ru: Опции

source: Help
ru_ru: Помощь

source: Testing
ru_ru: Тестирование

source: Year
ru_ru: Год рождения

source: Rented card
ru_ru: Аренда чипа

source: World code
ru_ru: Международный код

source: National code
ru_ru: Национальный код

source: Out of competition
ru_ru: Вне конкурса

source: Rented stub
ru_ru: Свой чип

source: o/c
ru_ru: в/к

source: Status
ru_ru: Статус

source: Place
ru_ru: Место

source: Course name
ru_ru: Дистанция

source: Chip
ru_ru: Чип

source: SPORTident readout
ru_ru: Чтение SPORTident

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: MF
ru_ru: МЖ

source: M
ru_ru: М

source: F
ru_ru: Ж

source: Individual race
ru_ru: Индивидуальная гонка

source: Mass start
ru_ru: Масс-старт

source: Pursuit
ru_ru: Гонка преследования

source: Relay
ru_ru: Эстафета

source: One man relay
ru_ru: Эстафета одного участника

source: Sprint relay
ru_ru: Смешанная эстафета

source: Finished
ru_ru: Финишировал

source: Missing punch
ru_ru: Непр. отметка

source: Active
ru_ru: Активный

source: Inactive
ru_ru: Неактивный

source: Sporting withdrawal
ru_ru: Проведена жеребьевка

source: Not competing
ru_ru: Вне конкурса

source: Moved
ru_ru: Перемещен

source: Moved up
ru_ru: Перемещен наверх

source: Did not enter
ru_ru: Не заявлен

source: Cancelled
ru_ru: Заявка отменена

source: Closing connection
ru_ru: Закрытие соединения

source: Opening port
ru_ru: Открытие порта

source: Cannot open port
ru_ru: Ошибка при открытии порта

source: Closing port
ru_ru: Закрытие порта

source: Open target WDB file
ru_ru: Открыть WDB файл

source: Open source WDB file
ru_ru: Открыть WDB файл

source: Save WDB file
ru_ru: Сохранить WDB файл

source: Margins
ru_ru: Поля

source: Left
ru_ru: Слева

source: Top
ru_ru: Сверху

source: Right
ru_ru: Справа

source: Bottom
ru_ru: Снизу

source: Handicap start time
ru_ru: Расчет старта из результата

source: Handicap mode
ru_ru: Гандикап

source: Reverse mode
ru_ru: Обратный порядок

source: Max gap from leader
ru_ru: Максимальное отставание для гандикапа

source: Start time for 2 group
ru_ru: Время старта непопавших в гандикап

source: Offset after DSQ
ru_ru: Интервал после снятых участников

source: Selected list report
ru_ru: Выписка по выбранным участникам
